2022-07/ofml-drl/test_cases/rotatingCylinder2D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs ("libAgentRotatingWallVelocity.so");

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         4.0;

deltaT          5.0e-4;

writeControl    runTime;

writeInterval   1.0;

purgeWrite      1;

writeFormat     ascii;

writePrecision  8;

timeFormat      general;

timePrecision   8;

runTimeModifiable false;

functions
{
    forces
    {
        type            forceCoeffs;
        libs            (forces);
        executeControl  timeStep;
        executeInterval 20;
        writeControl    timeStep;
        writeInterval   20;
        timeStart       2.0;
        log false;
        patches
        (
            cylinder
        );
        coefficients    (Cd Cl);
        rhoInf          1;
        rho             rhoInf;
        CofR            (0.2 0.2 0.005);
        liftDir         (0 1 0);
        dragDir         (1 0 0);
        magUInf         1.0;
        lRef            0.1;
        Aref            0.001;
    }
}

// ************************************************************************* //
