2022-07/ofml-drl/test_cases/rotatingCylinder2D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    top
    {
        type            patch;
        nFaces          138;
        startFace       10437;
    }
    bottom
    {
        type            patch;
        nFaces          138;
        startFace       10575;
    }
    inlet
    {
        type            patch;
        nFaces          25;
        startFace       10713;
    }
    outlet
    {
        type            patch;
        nFaces          25;
        startFace       10738;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          5325;
        startFace       10763;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          5325;
        startFace       16088;
    }
    cylinder
    {
        type            patch;
        nFaces          100;
        startFace       21413;
    }
)

// ************************************************************************* //
